MinSteve/hal_nxp/s32k/s32k-sdk/devices/S32K142W/S32K142W.svd
        <register>
          <name>OPACRD</name>
          <description>Off-Platform Peripheral Access Control Register</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x44440400</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TP5</name>
              <description>Trusted Protect</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP5_0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP5_1</name>
                  <description>Accesses from an untrusted master are not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP5</name>
              <description>Write Protect</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WP5_0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP5_1</name>
                  <description>This peripheral is write protected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SP5</name>
              <description>Supervisor Protect</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP5_0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP5_1</name>
                  <description>This peripheral requires supervisor privilege level for accesses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TP3</name>
              <description>Trusted Protect</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP3_0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP3_1</name>
                  <description>Accesses from an untrusted master are not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP3</name>
              <description>Write Protect</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WP3_0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP3_1</name>
                  <description>This peripheral is write protected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SP3</name>
              <description>Supervisor Protect</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP3_0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP3_1</name>
                  <description>This peripheral requires supervisor privilege level for accesses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TP2</name>
              <description>Trusted Protect</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP2_0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP2_1</name>
                  <description>Accesses from an untrusted master are not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP2</name>
              <description>Write Protect</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WP2_0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP2_1</name>
                  <description>This peripheral is write protected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SP2</name>
              <description>Supervisor Protect</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP2_0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP2_1</name>
                  <description>This peripheral requires supervisor privilege level for accesses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TP1</name>
              <description>Trusted Protect</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP1_0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1_1</name>
                  <description>Accesses from an untrusted master are not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP1</name>
              <description>Write Protect</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WP1_0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP1_1</name>
                  <description>This peripheral is write protected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SP1</name>
              <description>Supervisor Protect</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP1_0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP1_1</name>
                  <description>This peripheral requires supervisor privilege level for accesses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TP0</name>
              <description>Trusted Protect</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0_0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP0_1</name>
                  <description>Accesses from an untrusted master are not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP0</name>
              <description>Write Protect</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WP0_0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP0_1</name>
                  <description>This peripheral is write protected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SP0</name>
              <description>Supervisor Protect</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP0_0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP0_1</name>
                  <description>This peripheral requires supervisor privilege level for accesses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OPACRE</name>
          <description>Off-Platform Peripheral Access Control Register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000040</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TP6</name>
              <description>Trusted Protect</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP6_0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP6_1</name>
                  <description>Accesses from an untrusted master are not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP6</name>
              <description>Write Protect</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WP6_0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP6_1</name>
                  <description>This peripheral is write protected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SP6</name>
              <description>Supervisor Protect</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP6_0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP6_1</name>
                  <description>This peripheral requires supervisor privilege level for accesses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TP0</name>
              <description>Trusted Protect</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0_0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP0_1</name>
                  <description>Accesses from an untrusted master are not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP0</name>
              <description>Write Protect</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WP0_0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP0_1</name>
                  <description>This peripheral is write protected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SP0</name>
              <description>Supervisor Protect</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP0_0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP0_1</name>
                  <description>This peripheral requires supervisor privilege level for accesses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
