MinSteve/hal_nxp/s32k/s32k-sdk/devices/S32K142W/S32K142W.svd
        <register>
          <name>SOSCCFG</name>
          <description>System Oscillator Configuration Register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EREFS</name>
              <description>External Reference Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EREFS_0</name>
                  <description>External reference clock selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EREFS_1</name>
                  <description>Internal crystal oscillator of OSC selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HGO</name>
              <description>High Gain Oscillator Select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HGO_0</name>
                  <description>Configure crystal oscillator for low-gain operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HGO_1</name>
                  <description>Configure crystal oscillator for high-gain operation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGE</name>
              <description>System OSC Range Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RANGE_1</name>
                  <description>Low frequency range selected for the crystal oscillator</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RANGE_2</name>
                  <description>Medium frequency range selected for the crytstal oscillator</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RANGE_3</name>
                  <description>High frequency range selected for the crystal oscillator</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SIRCCSR</name>
          <description>Slow IRC Control Status Register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1000005</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SIRCEN</name>
              <description>Slow IRC Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIRCEN_0</name>
                  <description>Slow IRC is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCEN_1</name>
                  <description>Slow IRC is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIRCSTEN</name>
              <description>Slow IRC Stop Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIRCSTEN_0</name>
                  <description>Slow IRC is disabled in supported Stop modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCSTEN_1</name>
                  <description>Slow IRC is enabled in supported Stop modes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIRCLPEN</name>
              <description>Slow IRC Low Power Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIRCLPEN_0</name>
                  <description>Slow IRC is disabled in VLP modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCLPEN_1</name>
                  <description>Slow IRC is enabled in VLP modes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LK</name>
              <description>Lock Register</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LK_0</name>
                  <description>Control Status Register can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LK_1</name>
                  <description>Control Status Register cannot be written.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIRCVLD</name>
              <description>Slow IRC Valid</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIRCVLD_0</name>
                  <description>Slow IRC is not enabled or clock is not valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCVLD_1</name>
                  <description>Slow IRC is enabled and output clock is valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIRCSEL</name>
              <description>Slow IRC Selected</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIRCSEL_0</name>
                  <description>Slow IRC is not the system clock source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCSEL_1</name>
                  <description>Slow IRC is the system clock source</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SIRCDIV</name>
          <description>Slow IRC Divide Register</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SIRCDIV1</name>
              <description>Slow IRC Clock Divide 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIRCDIV1_0</name>
                  <description>Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCDIV1_1</name>
                  <description>Divide by 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCDIV1_2</name>
                  <description>Divide by 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCDIV1_3</name>
                  <description>Divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCDIV1_4</name>
                  <description>Divide by 8</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCDIV1_5</name>
                  <description>Divide by 16</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCDIV1_6</name>
                  <description>Divide by 32</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCDIV1_7</name>
                  <description>Divide by 64</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIRCDIV2</name>
              <description>Slow IRC Clock Divide 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIRCDIV2_0</name>
                  <description>Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCDIV2_1</name>
                  <description>Divide by 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCDIV2_2</name>
                  <description>Divide by 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCDIV2_3</name>
                  <description>Divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCDIV2_4</name>
                  <description>Divide by 8</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCDIV2_5</name>
                  <description>Divide by 16</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCDIV2_6</name>
                  <description>Divide by 32</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCDIV2_7</name>
                  <description>Divide by 64</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SIRCCFG</name>
          <description>Slow IRC Configuration Register</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RANGE</name>
              <description>Frequency Range</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RANGE_0</name>
                  <description>Slow IRC low range clock (2 MHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RANGE_1</name>
                  <description>Slow IRC high range clock (8 MHz )</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FIRCCSR</name>
          <description>Fast IRC Control Status Register</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIRCEN</name>
              <description>Fast IRC Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIRCEN_0</name>
                  <description>Fast IRC is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCEN_1</name>
                  <description>Fast IRC is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIRCREGOFF</name>
              <description>Fast IRC Regulator Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIRCREGOFF_0</name>
                  <description>Fast IRC Regulator is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCREGOFF_1</name>
                  <description>Fast IRC Regulator is disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LK</name>
              <description>Lock Register</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LK_0</name>
                  <description>Control Status Register can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LK_1</name>
                  <description>Control Status Register cannot be written.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIRCVLD</name>
              <description>Fast IRC Valid status</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIRCVLD_0</name>
                  <description>Fast IRC is not enabled or clock is not valid.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCVLD_1</name>
                  <description>Fast IRC is enabled and output clock is valid. The clock is valid once there is an output clock from the FIRC analog.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIRCSEL</name>
              <description>Fast IRC Selected status</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIRCSEL_0</name>
                  <description>Fast IRC is not the system clock source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCSEL_1</name>
                  <description>Fast IRC is the system clock source</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIRCERR</name>
              <description>Fast IRC Clock Error</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIRCERR_0</name>
                  <description>Error not detected with the Fast IRC trimming.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCERR_1</name>
                  <description>Error detected with the Fast IRC trimming.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FIRCDIV</name>
          <description>Fast IRC Divide Register</description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIRCDIV1</name>
              <description>Fast IRC Clock Divide 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIRCDIV1_0</name>
                  <description>Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCDIV1_1</name>
                  <description>Divide by 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCDIV1_2</name>
                  <description>Divide by 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCDIV1_3</name>
                  <description>Divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCDIV1_4</name>
                  <description>Divide by 8</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCDIV1_5</name>
                  <description>Divide by 16</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCDIV1_6</name>
                  <description>Divide by 32</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCDIV1_7</name>
                  <description>Divide by 64</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIRCDIV2</name>
              <description>Fast IRC Clock Divide 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIRCDIV2_0</name>
                  <description>Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCDIV2_1</name>
                  <description>Divide by 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCDIV2_2</name>
                  <description>Divide by 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCDIV2_3</name>
                  <description>Divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCDIV2_4</name>
                  <description>Divide by 8</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCDIV2_5</name>
                  <description>Divide by 16</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCDIV2_6</name>
                  <description>Divide by 32</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCDIV2_7</name>
                  <description>Divide by 64</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FIRCCFG</name>
          <description>Fast IRC Configuration Register</description>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RANGE</name>
              <description>Frequency Range</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RANGE_0</name>
                  <description>Fast IRC is trimmed to 48 MHz</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
