MinSteve/hal_nxp/s32k/s32k-sdk/devices/S32K142W/S32K142W.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RCM</name>
      <description>Reset Control Module</description>
      <groupName>RCM</groupName>
      <prependToName>RCM_</prependToName>
      <baseAddress>0x4007F000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>VERID</name>
          <description>Version ID Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x3000003</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEATURE</name>
              <description>Feature Specification Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FEATURE_3</name>
                  <description>Standard feature set.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MINOR</name>
              <description>Minor Version Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>Major Version Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAM</name>
          <description>Parameter Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x2FEE</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EWAKEUP</name>
              <description>Existence of SRS[WAKEUP] status indication feature</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EWAKEUP_0</name>
                  <description>The feature is not available.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EWAKEUP_1</name>
                  <description>The feature is available.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ELVD</name>
              <description>Existence of SRS[LVD] status indication feature</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ELVD_0</name>
                  <description>The feature is not available.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ELVD_1</name>
                  <description>The feature is available.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ELOC</name>
              <description>Existence of SRS[LOC] status indication feature</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ELOC_0</name>
                  <description>The feature is not available.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ELOC_1</name>
                  <description>The feature is available.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ELOL</name>
              <description>Existence of SRS[LOL] status indication feature</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ELOL_0</name>
                  <description>The feature is not available.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ELOL_1</name>
                  <description>The feature is available.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECMU_LOC</name>
              <description>Existence of SRS[CMU_LOC] status indication feature</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECMU_LOC_0</name>
                  <description>The feature is not available.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECMU_LOC_1</name>
                  <description>The feature is available.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EWDOG</name>
              <description>Existence of SRS[WDOG] status indication feature</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EWDOG_0</name>
                  <description>The feature is not available.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EWDOG_1</name>
                  <description>The feature is available.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPIN</name>
              <description>Existence of SRS[PIN] status indication feature</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPIN_0</name>
                  <description>The feature is not available.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPIN_1</name>
                  <description>The feature is available.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPOR</name>
              <description>Existence of SRS[POR] status indication feature</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPOR_0</name>
                  <description>The feature is not available.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPOR_1</name>
                  <description>The feature is available.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EJTAG</name>
              <description>Existence of SRS[JTAG] status indication feature</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EJTAG_0</name>
                  <description>The feature is not available.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EJTAG_1</name>
                  <description>The feature is available.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ELOCKUP</name>
              <description>Existence of SRS[LOCKUP] status indication feature</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ELOCKUP_0</name>
                  <description>The feature is not available.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ELOCKUP_1</name>
                  <description>The feature is available.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ESW</name>
              <description>Existence of SRS[SW] status indication feature</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ESW_0</name>
                  <description>The feature is not available.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ESW_1</name>
                  <description>The feature is available.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMDM_AP</name>
              <description>Existence of SRS[MDM_AP] status indication feature</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMDM_AP_0</name>
                  <description>The feature is not available.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMDM_AP_1</name>
                  <description>The feature is available.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ESACKERR</name>
              <description>Existence of SRS[SACKERR] status indication feature</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ESACKERR_0</name>
                  <description>The feature is not available.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ESACKERR_1</name>
                  <description>The feature is available.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ETAMPER</name>
              <description>Existence of SRS[TAMPER] status indication feature</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ETAMPER_0</name>
                  <description>The feature is not available.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ETAMPER_1</name>
                  <description>The feature is available.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECORE1</name>
              <description>Existence of SRS[CORE1] status indication feature</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECORE1_0</name>
                  <description>The feature is not available.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECORE1_1</name>
                  <description>The feature is available.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRS</name>
          <description>System Reset Status Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x82</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LVD</name>
              <description>Low-Voltage Detect Reset or High-Voltage Detect Reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LVD_0</name>
                  <description>Reset not caused by LVD trip, HVD trip or POR</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVD_1</name>
                  <description>Reset caused by LVD trip, HVD trip or POR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOC</name>
              <description>Loss-of-Clock Reset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOC_0</name>
                  <description>Reset not caused by a loss of external clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC_1</name>
                  <description>Reset caused by a loss of external clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOL</name>
              <description>Loss-of-Lock Reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOL_0</name>
                  <description>Reset not caused by a loss of lock in the PLL/FLL</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOL_1</name>
                  <description>Reset caused by a loss of lock in the PLL/FLL</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDOG</name>
              <description>Watchdog</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDOG_0</name>
                  <description>Reset not caused by watchdog timeout</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDOG_1</name>
                  <description>Reset caused by watchdog timeout</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN</name>
              <description>External Reset Pin</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIN_0</name>
                  <description>Reset not caused by external reset pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN_1</name>
                  <description>Reset caused by external reset pin</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR</name>
              <description>Power-On Reset</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_0</name>
                  <description>Reset not caused by POR</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_1</name>
                  <description>Reset caused by POR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JTAG</name>
              <description>JTAG generated reset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JTAG_0</name>
                  <description>Reset not caused by JTAG</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JTAG_1</name>
                  <description>Reset caused by JTAG</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCKUP</name>
              <description>Core Lockup</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCKUP_0</name>
                  <description>Reset not caused by core LOCKUP event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKUP_1</name>
                  <description>Reset caused by core LOCKUP event</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW</name>
              <description>Software</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SW_0</name>
                  <description>Reset not caused by software setting of SYSRESETREQ bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_1</name>
                  <description>Reset caused by software setting of SYSRESETREQ bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MDM_AP</name>
              <description>MDM-AP System Reset Request</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MDM_AP_0</name>
                  <description>Reset was not caused by host debugger system setting of the System Reset Request bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MDM_AP_1</name>
                  <description>Reset was caused by host debugger system setting of the System Reset Request bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SACKERR</name>
              <description>Stop Acknowledge Error</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SACKERR_0</name>
                  <description>Reset not caused by peripheral failure to acknowledge attempt to enter stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SACKERR_1</name>
                  <description>Reset caused by peripheral failure to acknowledge attempt to enter stop mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
